<a href="https://colab.research.google.com/github/anew0m/ABOOK_Pandas-basic/blob/main/02_SubsetObservations(Rows)/3)_%ED%8C%90%EB%8B%A4%EC%8A%A4_%EB%8D%B0%EC%9D%B4%ED%84%B0%ED%94%84%EB%A0%88%EC%9E%84_%EB%B9%84%EA%B5%90%EC%97%B0%EC%82%B0%EC%9E%90%EB%A1%9C_%EC%83%89%EC%9D%B8%ED%95%98%EA%B8%B0%2C_drop_duplicates().ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

# 3) 판다스 데이터프레임 비교연산자로 색인하기, drop_duplicates()

## Subset Observations (Rows)

In [1]:
import pandas as pd

df = pd.DataFrame (
    { "a" : [4, 5, 6], 
     "b" : [7, 8, 9],
     "c" : [10, 11, 12]},
     index = pd.MultiIndex.from_tuples (
         [('d', 1), ('d', 2), ('e', 2)], 
         names = ['n', 'v']
     )
)

In [2]:
df

     a  b   c
n v
d 1  4  7  10
  2  5  8  11
e 2  6  9  12

In [3]:
df[df.Length > 7]

AttributeError: ignored

* Length 라는 컬럼이 없어서 에러 발생

In [4]:
df[df.a > 7]

Empty DataFrame
Columns: [a, b, c]
Index: []

In [5]:
df[df.a < 7]

     a  b   c
n v
d 1  4  7  10
  2  5  8  11
e 2  6  9  12

In [6]:
df[df.b > 7]

     a  b   c
n v
d 2  5  8  11
e 2  6  9  12

In [7]:
df.b > 7

n  v
d  1    False
   2     True
e  2     True
Name: b, dtype: bool

In [10]:
df[df['c'] > 7]

     a  b   c
n v
d 1  4  7  10
  2  5  8  11
e 2  6  9  12

In [12]:
df[df['c'] == 7]

Empty DataFrame
Columns: [a, b, c]
Index: []

In [13]:
df[df['c'] >= 7]

     a  b   c
n v
d 1  4  7  10
  2  5  8  11
e 2  6  9  12

In [15]:
df.drop_duplicates()

     a  b   c
n v
d 1  4  7  10
  2  5  8  11
e 2  6  9  12

In [19]:
import pandas as pd

df = pd.DataFrame (
    { "a" : [4, 5, 6, 6], 
     "b" : [7, 8, 9, 9],
     "c" : [10, 11, 12, 12]},
     index = pd.MultiIndex.from_tuples (
         [('d', 1), ('d', 2), ('e', 2), ('e', 3)], 
         names = ['n', 'v']
     )
)

In [20]:
df

     a  b   c
n v
d 1  4  7  10
  2  5  8  11
e 2  6  9  12
  3  6  9  12

In [21]:
df.drop_duplicates()

     a  b   c
n v
d 1  4  7  10
  2  5  8  11
e 2  6  9  12

In [22]:
df

     a  b   c
n v
d 1  4  7  10
  2  5  8  11
e 2  6  9  12
  3  6  9  12

In [23]:
df.drop_duplicates(inplace = True) # df 변수에서 중복된값 바로 제거

In [24]:
df

     a  b   c
n v
d 1  4  7  10
  2  5  8  11
e 2  6  9  12

* inplace 를 권장하지 않음

In [25]:
df.drop_duplicates?

In [30]:
import pandas as pd

df = pd.DataFrame (
    { "a" : [4, 5, 6, 6], 
     "b" : [7, 8, 9, 9],
     "c" : [10, 11, 12, 12]},
     index = pd.MultiIndex.from_tuples (
         [('d', 1), ('d', 2), ('e', 2), ('e', 3)], 
         names = ['n', 'v']
     )
)

df

     a  b   c
n v
d 1  4  7  10
  2  5  8  11
e 2  6  9  12
  3  6  9  12

In [31]:
df.drop_duplicates(keep = 'last')

     a  b   c
n v
d 1  4  7  10
  2  5  8  11
e 3  6  9  12

In [32]:
df.drop_duplicates(keep = 'first')

     a  b   c
n v
d 1  4  7  10
  2  5  8  11
e 2  6  9  12